Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J19.PIC
      <edc:SFRDef edc:_addr="0x4002C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C0EC" edc:offset="0x3F1C"/>
      <edc:SFRDef edc:_addr="0x40030008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_CUST" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSV" edc:desc="Customer-specific Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003000C" edc:access="---nnnnnn--nnnnn----nnnn-nnn--nn" edc:cname="MCAN0_FBTP" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSJW" edc:desc="Fast (Re) Synchronization Jump Width" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FTSEG2" edc:desc="Fast Time Segment After Sample Point" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FTSEG1" edc:desc="Fast Time Segment Before Sample Point" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FBRP" edc:desc="Fast Baud Rate Prescaler" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDC" edc:desc="Transceiver Delay Compensation" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Transceiver Delay Compensation disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Transceiver Delay Compensation enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDCO" edc:desc="Transceiver Delay Compensation Offset" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030010" edc:access="------------------nnnnnnnnnn----" edc:cname="MCAN0_TEST" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LBCK" edc:desc="Loop Back Mode (read/write)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Reset value. Loop Back mode is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Loop Back mode is enabled (see Section 1.5.1.9)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TX" edc:desc="Control of Transmit Pin (read/write)" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SAMPLE_POINT_MONITORING" edc:desc="Sample Point can be monitored at pin CANTX." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DOMINANT" edc:desc="Dominant ('0') level at pin CANTX." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RECESSIVE" edc:desc="Recessive ('1') at pin CANTX." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RX" edc:desc="Receive Pin (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:desc="Transceiver Delay Compensation Value (read-only)" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030014" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="MCAN0_RWD" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDC" edc:desc="Watchdog Configuration (read/write)" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="WDV" edc:desc="Watchdog Value (read-only)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030018" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="MCAN0_CCCR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT" edc:desc="Initialization (read/write)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Normal operation." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Initialization is started." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CCE" edc:desc="Configuration Change Enable (read/write, write protection)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PROTECTED" edc:desc="The processor has no write access to the protected configuration registers." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CONFIGURABLE" edc:desc="The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1')." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASM" edc:desc="Restricted Operation Mode (read/write, write protection against '1')" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal CAN operation." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESTRICTED" edc:desc="Restricted operation mode active." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSA" edc:desc="Clock Stop Acknowledge (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:desc="Clock Stop Request (read/write)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_CLOCK_STOP" edc:desc="No clock stop is requested." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK_STOP" edc:desc="Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MON" edc:desc="Bus Monitoring Mode (read/write, write protection against '1')" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Bus Monitoring mode is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Bus Monitoring mode is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAR" edc:desc="Disable Automatic Retransmission (read/write, write protection)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AUTO_RETX" edc:desc="Automatic retransmission of messages not transmitted successfully enabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO_AUTO_RETX" edc:desc="Automatic retransmission disabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TEST" edc:desc="Test Mode Enable (read/write, write protection against '1')" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Normal operation, MCAN_TEST register holds reset values." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Test mode, write access to MCAN_TEST register enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CME" edc:desc="CAN Mode Enable (read/write, write protection)" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ISO11898_1" edc:desc="CAN operation according to ISO11898-1 enabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FD" edc:desc="CAN FD operation enabled" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="CAN Mode Request (read/write)" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_CHANGE" edc:desc="No mode change" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FD" edc:desc="Request CAN FD operation" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FD_BITRATE_SWITCH" edc:desc="Request CAN FD operation with bit rate switching" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ISO11898_1" edc:desc="Request CAN operation according ISO11898-1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FDO" edc:desc="CAN FD Operation (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FDBS" edc:desc="CAN FD Bit Rate Switching (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXP" edc:desc="Transmit Pause (read/write, write protection)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
