Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J19.PIC
      <edc:SFRDef edc:_addr="0x40040024" edc:access="--------------------------ww--ww" edc:cname="DACC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Enable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Enable of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040028" edc:access="--------------------------ww--ww" edc:cname="DACC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Disable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Disable of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004002C" edc:access="--------------------------rr--rr" edc:cname="DACC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Mask of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Mask of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Mask of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Mask of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040030" edc:access="--------------------------rr--rr" edc:cname="DACC_ISR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Flag of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Flag of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Flag of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Flag of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040034" edc:offset="0x60"/>
      <edc:SFRDef edc:_addr="0x40040094" edc:access="----------------------------nnnn" edc:cname="DACC_ACR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IBCTLCH0" edc:desc="Analog Output Current Control" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IBCTLCH1" edc:desc="Analog Output Current Control" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040098" edc:offset="0x4C"/>
      <edc:SFRDef edc:_addr="0x400400E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="DACC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x444143"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400400E8" edc:access="----------------rrrrrrrr-------r" edc:cname="DACC_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400400EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40044000" edc:access="-------------------------------w" edc:cname="ACC_CR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044004" edc:access="-----------------nnn-nnn-nnn-nnn" edc:cname="ACC_MR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SELMINUS" edc:desc="Selection for Minus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TS" edc:desc="Select TS" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="Select VREFP" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="Select DAC0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DAC1" edc:desc="Select DAC1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELPLUS" edc:desc="Selection For Plus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD4" edc:desc="Select AFE0_AD4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD5" edc:desc="Select AFE0_AD5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD0" edc:desc="Select AFE1_AD0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD1" edc:desc="Select AFE1_AD1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="Analog Comparator Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGETYP" edc:desc="Edge Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Only rising edge of comparator output" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of comparator output" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ANY" edc:desc="Any edge of comparator output" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INV" edc:desc="Invert Comparator Output" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator output is directly processed." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator output is inverted prior to being processed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELFS" edc:desc="Selection Of Fault Source" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CE" edc:desc="The CE flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTPUT" edc:desc="The output of the analog comparator flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Fault Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The FAULT output is tied to 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The FAULT output is driven by the signal defined by SELFS." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044008" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40044024" edc:access="-------------------------------w" edc:cname="ACC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044028" edc:access="-------------------------------w" edc:cname="ACC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
