Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J19.PIC
      <edc:SFRDef edc:_addr="0x40050504" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050508" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005050C" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050510" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x40050540" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050544" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050548" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005054C" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050550" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050554" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ5" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
